In [3]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [4]:
import pandas as pd
from pandas import Series, DataFrame

In [5]:
x = Series({"A":2, "B":3})
y1 = Series({"A":10, "B":100})
y2 = Series({"B":100, "A":10})
x

A    2
B    3
dtype: int64

In [6]:
y1

A     10
B    100
dtype: int64

In [7]:
y2

B    100
A     10
dtype: int64

In [8]:
x * y1

A     20
B    300
dtype: int64

In [9]:
x * y2

A     20
B    300
dtype: int64

In [10]:
x = Series({"A":2, "B":3})
y1 = Series({"A":10, "B":100})
y2 = Series({"B":100, "A":10})

In [11]:
y1 > x

A    True
B    True
dtype: bool

In [13]:
y2.gt(x)

A    True
B    True
dtype: bool

In [17]:
y2.sort_index() > x

A    True
B    True
dtype: bool

In [18]:
col1 = Series(["Alice", "Bob", "Cindy", "Dan"])
col2 = Series([4,5,6,7])
DataFrame({
    "name": col1,
    "score": col2,
})

    name  score
0  Alice      4
1    Bob      5
2  Cindy      6
3    Dan      7

In [22]:
d = DataFrame({
    "name": ["Alice", "Bob", "Cindy", "Dan"],
    "score": [4,5,6,7],
}, index=["A", "B", "C", "D"])
d

    name  score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan      7

In [24]:
# Series
# s.loc[X]   <- lookup by pandas index
# s.iloc[X]  <- lookup by integer position
# s[X]       <- depends (first try index, use int pos if necessary)

# DataFrame
# d.loc[X]   <- lookup by pandas ROW index
# d.iloc[X]  <- lookup by ROW integer position
# d[X]       <- lookup by COL index

In [25]:
d.loc["C"]

name     Cindy
score        6
Name: C, dtype: object

In [26]:
d.iloc[-1]

name     Dan
score      7
Name: D, dtype: object

In [27]:
d = DataFrame({
    "name": ["Alice", "Bob", "Cindy", "Dan"],
    "score": [4,5,6,7],
}, index=["A", "B", "C", "D"])
d

    name  score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan      7

In [30]:
d["score"]

A    4
B    5
C    6
D    7
Name: score, dtype: int64

In [32]:
d["score"].mean()

5.5

In [33]:
d = DataFrame({
    "name": ["Alice", "Bob", "Cindy", "Dan"],
    "score": [4,5,6,7],
}, index=["A", "B", "C", "D"])
d

    name  score
A  Alice      4
B    Bob      5
C  Cindy      6
D    Dan      7

In [34]:
d.iloc[-1, 0]

'Dan'

In [35]:
d.loc["C", "score"]

6

In [36]:
d.loc["C", "score"] += 10
d

    name  score
A  Alice      4
B    Bob      5
C  Cindy     16
D    Dan      7

In [37]:
# SLICING
d.iloc[1:-1, :]

    name  score
B    Bob      5
C  Cindy     16

In [39]:
d.iloc[:, 1] += 100
d

    name  score
A  Alice    104
B    Bob    105
C  Cindy    116
D    Dan    107

In [40]:
# s[BOOL SERIES]  <- gets all s values lined up with True
# d[X]            <- pulls out column with index X
# d[BOOL SERIES]  <- pulls out rows lined up with True

In [43]:
# want everybody with more than 106 points
b = d["score"] > 106
b

A    False
B    False
C     True
D     True
Name: score, dtype: bool

In [44]:
d[b]

    name  score
C  Cindy    116
D    Dan    107

In [45]:
d

    name  score
A  Alice    104
B    Bob    105
C  Cindy    116
D    Dan    107

In [46]:
d[d["score"] > 106]

    name  score
C  Cindy    116
D    Dan    107

In [53]:
df = pd.read_csv("IMDB-Movie-Data.csv")
df.head(3)

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M

In [57]:
df["Rating"].mean()

6.7234468937875755

In [58]:
df["Runtime"].mean()

113.17034068136273

In [59]:
# Question: what is the highest rated movie that had an above average runtime

In [63]:
long = df[df["Runtime"] > df["Runtime"].mean()]
long.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
6,6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M

In [68]:
long[long["Rating"] == long["Rating"].max()]

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
54,54,The Dark Knight,"Action,Crime,Drama",Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,533.32

In [73]:
better = df.iloc[:, 1:]
better.head(2)

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M

In [79]:
better.to_csv("better.csv", index=False)

In [80]:
pd.read_csv("better.csv").head()

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

In [83]:
stats = better.describe()
stats

              Year     Runtime      Rating
count   998.000000  998.000000  998.000000
mean   2012.779559  113.170341    6.723447
std       3.207549   18.828877    0.945682
min    2006.000000   66.000000    1.900000
25%    2010.000000  100.000000    6.200000
50%    2014.000000  111.000000    6.800000
75%    2016.000000  123.000000    7.400000
max    2016.000000  191.000000    9.000000

In [84]:
stats.loc["50%", "Runtime"] # want median runtime

111.0